app/controllers/questions_controller.rb

  def create
    @question = Question.new(question_params)
       if @question.save
---
INSERT INTO "questions" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "test"], ["body", "test"], ["created_at", "2015-06-23 17:36:02.101383"], ["updated_at", "2015-06-23 17:36:02.101383"]]

  def index
    @questions = []
    lists = 0
    while lists < Question.count
    @questions << [Question.all[lists].id, Question.all[lists].title, Question.all[lists].created_at, Question.all[lists].updated_at, Question.all[lists].body]
---
SELECT COUNT(*) FROM "questions"
SELECT "questions".* FROM "questions"

  def show
    @question = Question.all.where(id: params[:id]).first
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1  ORDER BY "questions"."id" ASC LIMIT 1  [["id", 1]]